; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	spectrograph0 - mode
	spectrograph1 - mode
	GroundStation4 - direction
	Star6 - direction
	GroundStation7 - direction
	Star3 - direction
	Star5 - direction
	Star1 - direction
	GroundStation2 - direction
	Star8 - direction
	Star0 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Planet15 - direction
	Planet16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star3)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star1)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet14)
	(supports instrument4 spectrograph0)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 Star8)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 spectrograph0)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 Star8)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
)
(:goal (and
	(pointing satellite1 Star17)
	(pointing satellite2 Star17)
	(pointing satellite3 Planet14)
	(have_image Phenomenon9 spectrograph1)
	(have_image Star10 spectrograph0)
	(have_image Planet11 spectrograph0)
	(have_image Phenomenon12 spectrograph1)
	(have_image Phenomenon13 spectrograph0)
	(have_image Planet14 spectrograph1)
	(have_image Planet15 spectrograph0)
	(have_image Planet16 spectrograph0)
	(have_image Star17 spectrograph0)
))

)

; plan
1. (turn_to satellite2 star17 planet14)
   deleted: (pointing satellite2 planet14)
   added: (pointing satellite2 star17)
   goals met: 1 of 12
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 12
3. (calibrate satellite1 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 1 of 12
4. (turn_to satellite1 planet11 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet11)
   goals met: 1 of 12
5. (take_image satellite1 planet11 instrument1 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 2 of 12
6. (turn_to satellite1 phenomenon9 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon9)
   goals met: 2 of 12
7. (take_image satellite1 phenomenon9 instrument1 spectrograph1)
   added: (have_image phenomenon9 spectrograph1)
   goals met: 3 of 12
8. (turn_to satellite1 phenomenon13 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon13)
   goals met: 3 of 12
9. (take_image satellite1 phenomenon13 instrument1 spectrograph0)
   added: (have_image phenomenon13 spectrograph0)
   goals met: 4 of 12
10. (turn_to satellite1 phenomenon12 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon12)
   goals met: 4 of 12
11. (take_image satellite1 phenomenon12 instrument1 spectrograph1)
   added: (have_image phenomenon12 spectrograph1)
   goals met: 5 of 12
12. (turn_to satellite1 planet14 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 planet14)
   goals met: 5 of 12
13. (take_image satellite1 planet14 instrument1 spectrograph1)
   added: (have_image planet14 spectrograph1)
   goals met: 6 of 12
14. (turn_to satellite1 planet15 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet15)
   goals met: 6 of 12
15. (take_image satellite1 planet15 instrument1 spectrograph0)
   added: (have_image planet15 spectrograph0)
   goals met: 7 of 12
16. (turn_to satellite1 planet16 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet16)
   goals met: 7 of 12
17. (take_image satellite1 planet16 instrument1 spectrograph0)
   added: (have_image planet16 spectrograph0)
   goals met: 8 of 12
18. (turn_to satellite1 star10 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 star10)
   goals met: 8 of 12
19. (take_image satellite1 star10 instrument1 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 9 of 12
20. (turn_to satellite1 star17 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star17)
   goals met: 10 of 12
21. (take_image satellite1 star17 instrument1 spectrograph0)
   added: (have_image star17 spectrograph0)
   goals met: 11 of 12
22. (turn_to satellite3 planet14 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 planet14)
   goals met: 12 of 12
